RailsTrain/app/controllers/subjects_controller.rb

SELECT COUNT(*) FROM `subjects`
---
  def new
    @subject = Subject.new({name: "Sid",})
     @subject_count = Subject.count + 1

INSERT INTO `subjects` (`created_at`, `updated_at`, `name`, `position`) VALUES ('2016-09-26 11:54:21', '2016-09-26 11:54:21', 'Test Subject', 8)
---
  def create
    @subject = Subject.new(subject_params)
    if @subject.save

SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 3 LIMIT 1
UPDATE `subjects` SET `name` = 'Last', `position` = 3, `created_at` = '2016-09-26 09:27:00', `updated_at` = '2016-09-27 10:12:35' WHERE `subjects`.`id` = 1
---
  def update
  @subject = Subject.find(params[:id])
  if @subject.update_attributes(subject_params)

SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 4 LIMIT 1
DELETE FROM `subjects` WHERE `subjects`.`id` = 4
---
  def destroy
    subject = Subject.find(params[:id])
    subject.destroy